In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
df=pd.read_csv('train.csv')

In [3]:
df.head()

   row_id             datetime       energy
0       1  2008-03-01 00:00:00  1259.985563
1       2  2008-03-01 01:00:00  1095.541500
2       3  2008-03-01 02:00:00  1056.247500
3       4  2008-03-01 03:00:00  1034.742000
4       5  2008-03-01 04:00:00  1026.334500

In [4]:
df.shape

(94992, 3)

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 94992 entries, 0 to 94991
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   row_id    94992 non-null  int64
 1   datetime  94992 non-null  object
 2   energy    93092 non-null  float64
dtypes: float64(1), int64(1), object(1)
memory usage: 2.2+ MB

In [6]:
df.drop('row_id',axis=1,inplace=True)

In [7]:
df.head()

              datetime       energy
0  2008-03-01 00:00:00  1259.985563
1  2008-03-01 01:00:00  1095.541500
2  2008-03-01 02:00:00  1056.247500
3  2008-03-01 03:00:00  1034.742000
4  2008-03-01 04:00:00  1026.334500

In [8]:
# df['date'] = pd.to_datetime(df['datetime']).dt.date
# df['time'] = pd.to_datetime(df['datetime']).dt.time

df['year'] = pd.DatetimeIndex(df['datetime']).year
df['month'] = pd.DatetimeIndex(df['datetime']).month
df['day'] = pd.DatetimeIndex(df['datetime']).day
df['hour'] = pd.DatetimeIndex(df['datetime']).hour
df['minute'] = pd.DatetimeIndex(df['datetime']).minute
df['second'] = pd.DatetimeIndex(df['datetime']).second


# df['hour']=df['datetime'].dt.hour
# df['minute']=df['datetime'].dt.minute
# df['second']=df['second'].dt.second

In [9]:
df.head()

              datetime       energy  year  month  day  hour  minute  second
0  2008-03-01 00:00:00  1259.985563  2008      3    1     0       0       0
1  2008-03-01 01:00:00  1095.541500  2008      3    1     1       0       0
2  2008-03-01 02:00:00  1056.247500  2008      3    1     2       0       0
3  2008-03-01 03:00:00  1034.742000  2008      3    1     3       0       0
4  2008-03-01 04:00:00  1026.334500  2008      3    1     4       0       0

In [10]:
df.drop('datetime',axis=1,inplace=True)

In [11]:
df.head()

        energy  year  month  day  hour  minute  second
0  1259.985563  2008      3    1     0       0       0
1  1095.541500  2008      3    1     1       0       0
2  1056.247500  2008      3    1     2       0       0
3  1034.742000  2008      3    1     3       0       0
4  1026.334500  2008      3    1     4       0       0

In [12]:
df.isnull().sum()

energy    1900
year         0
month        0
day          0
hour         0
minute       0
second       0
dtype: int64

In [13]:
df['energy']=df['energy'].fillna(df['energy'].mean())

In [14]:
X=df.drop('energy',axis=1)
y=df.energy

In [15]:
X

       year  month  day  hour  minute  second
0      2008      3    1     0       0       0
1      2008      3    1     1       0       0
2      2008      3    1     2       0       0
3      2008      3    1     3       0       0
4      2008      3    1     4       0       0
...     ...    ...  ...   ...     ...     ...
94987  2018     12   31    19       0       0
94988  2018     12   31    20       0       0
94989  2018     12   31    21       0       0
94990  2018     12   31    22       0       0
94991  2018     12   31    23       0       0

[94992 rows x 6 columns]

In [16]:
y

0        1259.985563
1        1095.541500
2        1056.247500
3        1034.742000
4        1026.334500
            ...
94987    2528.446800
94988    2461.883600
94989    2365.994400
94990    2342.942800
94991    2180.217600
Name: energy, Length: 94992, dtype: float64

In [17]:
from sklearn.model_selection import train_test_split
X_train,X_test,y_train,y_test=train_test_split(X,y,test_size=0.2,random_state=42)

In [18]:
from sklearn.linear_model import LinearRegression
from sklearn.ensemble import RandomForestRegressor
from xgboost import XGBRegressor

In [19]:
alg=[LinearRegression(),RandomForestRegressor(),XGBRegressor()]
names=['LR','RR','XR']

In [20]:
from sklearn.metrics import mean_squared_error

In [21]:
l1=[]
for i in alg:
    model=i
    model.fit(X_train,y_train)
    y_hat=model.predict(X_test)
    MSE=mean_squared_error(y_test,y_hat)
    l1.append(MSE)

In [22]:
eval=pd.DataFrame({'Model':names,
                  'MSE':l1})

In [23]:
eval

  Model           MSE
0    LR  70994.115821
1    RR   7646.953485
2    XR  15968.939908

In [24]:
from math import sqrt

In [25]:
sqrt(7591.621747)

87.12991304368437

### Thus due to high accuracy RandomForest Regressor

In [26]:
### Model

In [27]:
df=pd.read_csv('train.csv')
df.drop('row_id',axis=1,inplace=True)

df['year'] = pd.DatetimeIndex(df['datetime']).year
df['month'] = pd.DatetimeIndex(df['datetime']).month
df['day'] = pd.DatetimeIndex(df['datetime']).day
df['hour'] = pd.DatetimeIndex(df['datetime']).hour
df['minute'] = pd.DatetimeIndex(df['datetime']).minute
df['second'] = pd.DatetimeIndex(df['datetime']).second

df.drop('datetime',axis=1,inplace=True)

df['energy']=df['energy'].fillna(df['energy'].mean())

In [28]:
df.head()

        energy  year  month  day  hour  minute  second
0  1259.985563  2008      3    1     0       0       0
1  1095.541500  2008      3    1     1       0       0
2  1056.247500  2008      3    1     2       0       0
3  1034.742000  2008      3    1     3       0       0
4  1026.334500  2008      3    1     4       0       0

In [29]:
df.isnull().sum()

energy    0
year      0
month     0
day       0
hour      0
minute    0
second    0
dtype: int64

In [30]:
X=df.drop('energy',axis=1)
y=df.energy

In [101]:
## Testing

In [102]:
test=pd.read_csv('test.csv')

In [103]:
test.head()

   row_id             datetime
0   94993  2019-01-01 00:00:00
1   94994  2019-01-01 01:00:00
2   94995  2019-01-01 02:00:00
3   94996  2019-01-01 03:00:00
4   94997  2019-01-01 04:00:00

In [104]:
test.drop('row_id',axis=1,inplace=True)

In [105]:
test.head()

              datetime
0  2019-01-01 00:00:00
1  2019-01-01 01:00:00
2  2019-01-01 02:00:00
3  2019-01-01 03:00:00
4  2019-01-01 04:00:00

In [106]:
test['year'] = pd.DatetimeIndex(test['datetime']).year
test['month'] = pd.DatetimeIndex(test['datetime']).month
test['day'] = pd.DatetimeIndex(test['datetime']).day
test['hour'] = pd.DatetimeIndex(test['datetime']).hour
test['minute'] = pd.DatetimeIndex(test['datetime']).minute
test['second'] = pd.DatetimeIndex(test['datetime']).second

In [107]:
test.head()

              datetime  year  month  day  hour  minute  second
0  2019-01-01 00:00:00  2019      1    1     0       0       0
1  2019-01-01 01:00:00  2019      1    1     1       0       0
2  2019-01-01 02:00:00  2019      1    1     2       0       0
3  2019-01-01 03:00:00  2019      1    1     3       0       0
4  2019-01-01 04:00:00  2019      1    1     4       0       0

In [108]:
test.drop('datetime',axis=1,inplace=True)

In [109]:
test.head()

   year  month  day  hour  minute  second
0  2019      1    1     0       0       0
1  2019      1    1     1       0       0
2  2019      1    1     2       0       0
3  2019      1    1     3       0       0
4  2019      1    1     4       0       0

In [110]:
y_hat=rr.predict(test)

In [111]:
y_hat

array([1877.09933323, 1893.84389085, 1910.58844848, ..., 2472.90150232,
       2489.64605994, 2506.39061756])

In [112]:
submission=pd.read_csv('sample_submission_jn0a7vR.csv')

In [113]:
submission.head()

   row_id       energy
0   94993  1702.995014
1   94994  1702.995014
2   94995  1702.995014
3   94996  1702.995014
4   94997  1702.995014

In [114]:
submission['energy']=y_hat

In [115]:
submission.head()

   row_id       energy
0   94993  1877.099333
1   94994  1893.843891
2   94995  1910.588448
3   94996  1927.333006
4   94997  1944.077564

In [116]:
submission.to_csv('my_submission.csv', index=False)